{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u008d\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "trainable": true, "arguments": {}, "batch_input_shape": [null, 100, 320, 3], "input_dtype": "float32", "name": "lambda_1", "output_shape": [100, 320, 3], "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "batch_input_shape": [null, 100, 320, 3], "input_dtype": "float32", "b_regularizer": null, "b_constraint": null, "nb_row": 5, "subsample": [1, 1], "dim_ordering": "tf", "init": "glorot_uniform", "bias": true, "nb_col": 5, "nb_filter": 24, "border_mode": "valid", "name": "convolution2d_1", "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "b_constraint": null, "activation": "linear", "subsample": [1, 1], "nb_filter": 36, "init": "glorot_uniform", "nb_col": 5, "bias": true, "border_mode": "valid", "name": "convolution2d_2", "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_regularizer": null, "b_constraint": null, "activation": "linear", "subsample": [1, 1], "nb_filter": 48, "init": "glorot_uniform", "nb_col": 3, "bias": true, "border_mode": "valid", "name": "convolution2d_3", "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "b_regularizer": null, "b_constraint": null, "activation": "linear", "subsample": [1, 1], "nb_filter": 64, "init": "glorot_uniform", "nb_col": 3, "bias": true, "border_mode": "valid", "name": "convolution2d_4", "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "input_dim": 4352, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "activation": "relu", "init": "glorot_uniform", "output_dim": 100, "bias": true, "name": "dense_1", "W_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "input_dim": 100, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "activation": "relu", "init": "glorot_uniform", "output_dim": 50, "bias": true, "name": "dense_2", "W_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "input_dim": 50, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "activation": "relu", "init": "glorot_uniform", "output_dim": 10, "bias": true, "name": "dense_3", "W_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "input_dim": 10, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 1, "bias": true, "name": "dense_4", "W_constraint": null}}]}